// // Задача 40 Напишите программу, которая принимает на вход три
// числа и проверяет, может ли существовать треугольник с сторонами
// такой длины.
// Теорема о неравенстве треугольника: каждая сторона треугольника
// меньше суммы двух других сторон.



Console.Clear();
System.Console.WriteLine("введите три числа ");
int x = int.Parse(Console.ReadLine()!);
int y = int.Parse(Console.ReadLine()!);
int z = int.Parse(Console.ReadLine()!);